// ignore: unused_import
import 'package:intl/intl.dart' as intl;
import 'app_localizations.dart';

// ignore_for_file: type=lint

/// The translations for Tibetan (`bo`).
class AppLocalizationsBo extends AppLocalizations {
  AppLocalizationsBo([String locale = 'bo']) : super(locale);

  @override
  String get appName => 'དགོན་སྐོར་';

  @override
  String get home => 'ཁྱིམ།';

  @override
  String get map => 'ཁྱིམ།';

  @override
  String get qr => 'ཀྱུ་ར།';

  @override
  String get search => 'འཚོལ།';

  @override
  String get settings => 'སྒྲིག་འགོད།';

  @override
  String get appearance => 'སྣང་བ།';

  @override
  String get language => 'སྐད་ཡིག';

  @override
  String get support => 'རྒྱབ་སྐྱོར།';

  @override
  String get legal => 'ཁྲིམས་ལུགས་';

  @override
  String get system => 'ལམ་ལུགས་';

  @override
  String get dark => 'མུན་ནག་';

  @override
  String get light => 'འོད།';

  @override
  String get faq => 'དྲི་བ་དྲིས་ལན།';

  @override
  String get contactUs => 'འབྲེལ་གཏུག';

  @override
  String get privacyPolicy => 'སྒེར་གནས་སྲིད་ཇུས།';

  @override
  String get contactSupport => 'འབྲེལ་མཐུད།';

  @override
  String get sendEmail => 'གློག་འཕྲིན་';

  @override
  String get close => 'ཁ་རྒྱག';

  @override
  String get recentSearches => 'ཉེ་ཆར་གྱི་འཚོལ་བྱེད།';

  @override
  String get suggestion => 'འོས་སྦྱོར།';

  @override
  String get detail => 'ཞིབ་ཕྲ།';

  @override
  String get deities => 'རྟེན་བཤད།';

  @override
  String get organizations => 'ཆོས་སྡེ།';

  @override
  String get festival => 'དུས་ཆེན།';

  @override
  String get deity => 'རྟེན་བཤད།';

  @override
  String get organization => 'ཆོས་སྡེ།';

  @override
  String get scanQrCode => 'གསང་བའི་དྲྭ་མིག';

  @override
  String get address => 'ཁ་བྱང་';

  @override
  String get location => 'ས་གནས།';

  @override
  String get noRecordFound => 'འཚོལ་བཤེར་ནང་མེད།';

  @override
  String get noRecentSearch => 'ཉེ་ཆར་གྱི་འཚོལ་བཤེར་ལོ་རྒྱུས་';

  @override
  String get buddha => 'སངས།';

  @override
  String get king => 'རྒྱལ།';

  @override
  String get gaden => 'དགའ་ལྡན།';

  @override
  String get arya => 'ཨརྱ།';

  @override
  String get acharya => 'སློབ་དཔོན་';

  @override
  String get milarepa => 'མི་ལ་རེ་པ།';

  @override
  String get india => 'རྒྱ་གར།';

  @override
  String get nepal => 'བལ་ཡུལ།';

  @override
  String get bhutan => 'འབྲུག་ཡུལ།';

  @override
  String get darkMode => 'འཆར་ངོས་ནག་པོ།';

  @override
  String get theme => 'འཆར་ངོས།';

  @override
  String get aboutUs => 'ང་ཚོའི་སྐོར།';

  @override
  String get aboutApp => 'མཉེན་ཆས་འདིའི་སྐོར།';

  @override
  String get prayerApp => 'ཞལ་འདོན་མཉེན་ཆས་སྐོར།';

  @override
  String get shareApp => 'མཉེན་ཆས་བརྒྱུད་སྤེལ།';

  @override
  String get nyingma => 'རྙིང་མ།';

  @override
  String get kagyu => 'བཀའ་བརྒྱུད།';

  @override
  String get sakya => 'ས་སྐྱ།';

  @override
  String get gelug => 'དགེ་ལུགས།';

  @override
  String get bon => 'བོན།';

  @override
  String get jonang => 'ཇོ་ནང་།';

  @override
  String get remey => 'རིས་མེད།';

  @override
  String get shalu => 'ཞ་ལུ།';

  @override
  String get bodong => 'བོ་དོང༌།';

  @override
  String get others => 'གཞན།';

  @override
  String get allGonpa => 'དགོན་པ་ཡོངས་རྫོགས།';

  @override
  String get pilgrimage => 'གནས་བཤད།';

  @override
  String get neykor => 'གནས་སྐོར།';

  @override
  String get deptName => '༄༅། །བོད་མིའི་སྒྲིག་འཛུགས་ཆོས་རིག་ལས་ཁུངས།';

  @override
  String get downloadApp => 'མཉེན་ཆས་ཕབ་ལེན་བྱོས།';

  @override
  String get gonpaTypes => 'སྡེ་ཚན།';

  @override
  String get allStates => 'མངའ་སྡེ་ཚང་མ།';

  @override
  String get deptDescription => '༄༅།། འཛམ་གླིང་སྐྱེ་འགྲོའི་བདེ་སྐྱིད་ལ་ཇི་མི་སྙམ་པར་རྒྱ་ནག་སྲིད་གཞུང་གིས་བོད་ནང་བཙན་འཛུལ་བྱས་ཏེ་བོད་ཆོས་ལྡན་གྱི་རྒྱལ་ཁབ་བཙན་བཟུང་བྱས་པར་བརྟེན། ༸གོང་ས་༸སྐྱབས་མགོན་ཆེན་པོ་མཆོག་གིས་སྐྱེ་འགྲོ་སྤྱི་དང༌བྱེ་བྲག་བོད་མིའི་འཕྲལ་ཕུགས་ཕན་བདེ་ལ་དགོངས་པ་ཆེ་བཞེས་ཀྱིས་རྒྱ་གར་འཕགས་པའི་ཡུལ་དུ་༸ཞབས་སོར་འཁོད་འཕྲལ། ཕྱི་ལོ་ ༡༩༥༩ ཟླ་ ༤ ཚེས་ ༢༧ ཉིན་བཞུགས་སྒར་མ་སུ་རིར་དང་ཐོག་༼ཆོས་དོན་ལྷན་ཚོགས་༽ཞེས་པ་གསར་འཛུགས་ཀྱིས་བྲོས་བྱོལ་དུ་ཕེབས་པའི་རིས་མེད་དགེ་འདུན་རྣམས་ལ་གཟིགས་སྐྱོང་དང་། ཆོས་སྡེ་དང་རིག་གཞུང་བསྟི་གནས་བཅས་པ་གསར་འཛུགས་གནང་རྒྱུས་མཚོན། བོད་ཀྱི་ཆོས་དང་རིག་གཞུང་མི་ཉམས་རྒྱུན་འཛིན་དང་ཉམས་པ་སླར་གསོ་བྱ་རྒྱུའི་ལས་དོན་ཆེ་ཕྲ་མང་པོ་བསྐྱངས་པ་ནས་བཟུང་། ཕྱི་ལོ་ ༡༩༨༢ ཟླ་ ༤ ཚེས་ ༢༥ ཉིན་གནས་ཡུལ་རྒྱལ་ཁབ་ཀྱི་ཁྲིམས་སྲོལ་དང་མཐུན་པར་བོད་ཀྱི་རིག་གཞུང་ཚོགས་པ་དང༌། ཕྱི་ལོ་ ༡༩༩༨ ཟླ་ ༦ ཚེས་ ༡༩ ཉིན་བོད་ཀྱི་ཆོས་དང་རིག་གཞུང་ཚོགས་པ་ཞེས་པའི་མཚན་ཐོག་དེབ་བསྐྱེལ་དང་སྦྲགས་མང་གཙོའི་ཁྲིམས་ལུགས་ལྡན་པའི་དབུས་བོད་མིའི་སྒྲིག་འཛུགས་ཀྱི་འཛིན་སྐྱོང་སྡེ་ཚན་ཁོངས་ལྷན་ཁང་ཞིག་གི་ངོ་བོར་༼ཆོས་རིག་ལས་ཁུངས།༽ཞེས་གནས་ཡོད།';

  @override
  String get aboutAppDescription => '༄༅། །ཕྱི་ལོ་ ༡༩༥༩ ལོར་བོད་ལ་དུས་འགྱུར་ཆེན་པོ་བྱུང་བའི་དབང་གིས་བོད་ཀྱི་ལོ་རྒྱུས་ལྡན་པའི་རྩ་ཆེའི་དགོན་པ་དང་ལྷ་ཁང་དྲུག་སྟོང་ལྷག་རྩ་གཏོར་བཏང་བ་མ་ཟད། ཤིན་ཏུ་རྩ་ཆེའི་ཡིག་ཆ་གྲངས་ལས་འདས་པ་རྩ་མེད་བཟོས་ཡོད་ན་ཡང་རྒྱ་གར་དུ་བཙན་བྱོལ་བོད་མིའི་སྒྲིག་འཛུགས་གསར་འཛུགས་དང་། ལྷག་པར་དུ་སྤྱི་ནོར་༸གོང་ས་༸སྐྱབས་མགོན་ཆེན་པོ་མཆོག་གིས་དབུས་པའི་ཆོས་བརྒྱུད་ཁག་གི་དབུ་ཁྲིད་བླ་ཆེན་ཁག་དང་། རིས་མེད་བསྟན་བདག་བླ་ཆེན་རྣམ་པས་སྐུ་ངལ་ཁྱད་བསད་ལ་བརྟེན་ནས་འདས་པའི་ལོ་ངོ་ ༦༥ ཙམ་ནང་བཙན་བྱོལ་དུ་རྒྱ་བལ་འབྲུག་གསུམ་ནང་དགོན་སྡེ་རྒྱ་ཕྲག་མང་པོ་ཕྱག་བཏབ་སྟེ། ད་ཆ་བོད་མིའི་འདུས་སྡོད་ས་གནས་ཁག་ནང་བོད་ཀྱི་དགོན་སྡེ་དང་། ལྷ་ཁང་མང་པོ་ཡོད་པ་མ་ཟད། དེ་དག་ནང་རྩ་ཆེའི་སྐུ་གསུང་ཐུགས་རྟེན་གྲངས་ལས་འདས་པ་ཡོད།\nདེང་སང་མི་རྣམས་ཀྱི་དཔལ་འབྱོར་དང་འཚོ་བར་ཡར་རྒྱས་ཕྱིན་པར་བརྟེན། ཡུལ་ལུང་སོ་སོའི་ནང་ཡུལ་སྐོར་སྤྲོ་འཆམ་ཇེ་མང་དུ་འགྲོ་བཞིན་ཡོད་པ་དང་། བོད་མིའི་གཞིས་ཆགས་ཁག་དུའང་བོད་ཀྱི་ཆོས་སྡེ་ཁག་ཏུ་གནས་སྐོར་སོགས་ལ་ཕེབས་མཁན་བོད་པ་ཙམ་མ་ཡིན་པར་ཧི་མཱ་ལ་ཡའི་རི་རྒྱུད་ཀྱི་བོད་རིགས་ནང་པ་དང་། རྒྱ་གར་བ། དེ་བཞིན་ཕྱི་རྒྱལ་མི་རིགས་མང་དག་ཅིག་སླེབས་བཞིན་ཡོད། དེ་དང་བསྟུན་ནས་བོད་མིའི་སྒྲིག་འཛུགས་ཆོས་རིག་ལས་ཁུངས་ནས་གནས་སྐོར་དང་ཡུལ་སྐོར་སྤྲོ་འཆམ་ལ་ཕེབས་མཁན་ཚོས་དགོན་པ་དང་སྐུ་གསུང་ཐུགས་རྟེན་མཇལ་བ་ཙམ་མ་ཡིན་པར་དགོན་སྡེའི་ལོ་རྒྱུས་དང་། དེ་དག་ནང་དུ་ཡོད་པའི་སྐུ་རྟེན་ཁག་གི་སྐོར་མདོར་ཙམ་མཁྱེན་རྟོགས་སླད་ཆོས་སྡེ་དང་སྐུ་རྟེན་ངོ་སྤྲོད་ཀྱི་གནས་བསྐོར་མཉེན་ཆས་ཀྱི་ལས་གཞི་དེ་བརྩམས་པ་རེད། མཉེན་ཆས་འདི་བརྒྱུད་ཡུལ་སྐོར་སྤྲོ་འཆམ་དུ་ཕེབས་མཁན་རྣམས་ནས་བོད་ཀྱི་དགོན་སྡེ་དང་རྩ་ཆེའི་སྐུ་རྟེན་ཁག དེ་བཞིན་ནང་པའི་གནས་ཆེན་དང་། བོད་ཀྱི་དུས་ཆེན་སོགས་ཀྱི་སྐོར་ཤེས་རྟོགས་ཐུབ་ནས་བོད་ཀྱི་ཆོས་དང་རིག་གཞུང་གི་རིན་ཐང་ཤེས་རྟོགས་དང་། ལྷག་པར་དུ་བོད་རིགས་གཞོན་སྐྱེས་དང་ཧི་མཱ་ལ་ཡའི་ནང་པ་གཞོན་སྐྱེས་ཚོས་དགོན་སྡེ་ཁག་ནང་ཕེབས་པའི་སྐབས་དུས་རབས་ཉེར་གཅིག་གི་ནང་པ་ཞིག་ཡིན་པའི་ཆ་ནས་སྐུ་རྟེན་སོགས་ངོ་སྤྲོད་ཤེས་པའི་ཐོག་ནས་དད་པ་སྐྱེས་ཐུབ་ཡག་ལ་ཕན་ཐོགས་ཆེན་པོ་ཡོང་ཐུབ། མཉེན་ཆས་འདིའི་ནང་དགོན་སྡེ་དང་སྐུ་རྟེན་ངོ་སྤྲོད་གཅིག་པུ་མ་ཡིན་པར་ད་དུང་ཆོས་སྡེ་ཁག་སོ་སོའི་ས་ཁྲ་དང་། དུས་ཆེན་ངོ་སྤྲོད་སོགས་ཀྱང་གཟིགས་རྒྱུ་ཡོད། ང་ཚོའི་རེ་བར་དགོན་སྡེ་ཁག་ལ་ཕེབས་མཁན་རྣམས་ཀྱིས་གནས་བསྐོར་མཉེན་ཆས་འདི་བརྒྱུད་དགོན་པའི་ལོ་རྒྱུས་དང་། སྐུ་རྟེན་ངོ་སྤྲོད། གནས་ཆེན་སོགས་ཀྱི་སྐོར་སྙིང་བསྡུས་མཁྱེན་ཐུབ་པའི་རེ་བ་ཡོད། ཆོས་རིག་ལས་ཁུངས་ནས། ཕྱི་ལོ་ ༢༠༢༥ ཟླ་ ཚེས་ ལ།།';

  @override
  String get prayerAppDescription => '༄༅།། དེང་དུས་འཛམ་གླིང་ནང་འཕྲུལ་ཆས་ཡར་རྒྱས་འགྲོ་བཞིན་པ་དང་བསྟུན། བོད་མིའི་སྒྲིག་འཛུགས་ ཆོས་རིག་ལས་ཁུངས་ནས་ནང་ཆོས་དོན་གཉེར་ཅན་རྣམས་ལ་དུས་ཀྱི་དགོས་མཁོ་དང་འཚམས་པའི་དྲ་ཐོག་ ཞལ་འདོན་མཉེན་ཆས་འདི་ཕྱི་ལོ་ ༢༠༢༣ ཟླ་ ༠༡ ཚེས་ ༢༤ ཉིན་ལེགས་གྲུབ་ཀྱིས་ཚེས་ ༢༧ ཉིན་དབུ་ འབྱེད་དང་སྦྲགས་དྲ་ཐོག་འདོན་སྤེལ་ཞུས་ཡོད། མཉེན་ཆས་འདིའི་ནང་ཉེར་མཁོའི་ཞལ་འདོན་རྒྱས་བསྡུས་ གཉིས་དང་། གཟུངས་སྔགས། ྋརྒྱལ་བའི་སྐུ་ཕྱྭ་དང་བསྟན་སྲིད་ཞབས་རིམ། གཞུང་འབྲེལ་ཕྱག་དཔེ། ཆོས་ བརྒྱུད་ཁག་དང་གཡུང་དྲུང་བོན་བཅས་ཀྱི་ཞལ་འདོན། བོད་ཀྱི་དུས་ཆེན་ཁག་དང་ནང་པའི་གནས་ཆེན་ཁག་གི་ངོ་སྤྲོད་བཅས་ཡོད། མཉེན་ཆས་འདི་ལེགས་གྲུབ་ཡོང་ཐབས་སུ་བོད་ཀྱི་ཆོས་བརྒྱུད་ཁག་དང་གཡུང་དྲུང་བོན་ བཅས་ཀྱི་ན ་མ་དགོན་ནས་ཆོས་བརྒྱུད་སོ་སོའི་ཞལ་འདོན་ཕྱོགས་སྒྲིག་གི་མཐུན་འགྱུར་དང་། ༧སྐུ་བཅར་རྣམ་ རྒྱལ་གྲྭ་ཚང་གི་དགེ་བཤེས་བློ་བཟང་གྲགས་པ་ལགས་དང་། ས་རཱ་མཐོ་སློབ་པར་བསྐྲུན་ཁང་ནས་ཞལ་འདོན་ ཕྱོགས་སྒྲིག་ཐོག་ཕྱག་རོགས། དེ་བཞིན་བོད་ཀྱི་དཔེ་མཛོད་ཁང་ནས་བོད་ཀྱི་དུས་ཆེན་ངོ་སྤྲོད་དང་ནང་པའི་གནས་ཆེན་ཁག་གི་ངོ་སྤྲོད་ཀྱི་ཡིག་ཆའི་མཐུན་འགྱུར་མཐུན་འགྱུར་གནང་བ་བཅས་ལ་ཐུགས་རྗེ་ཆེ་། ལྷག་ པར་དུ་ཨི་ཊ་ལི་ནང་པའི་མཐུན་ཚོགས་ (Italian Buddhist Union) ནས་མཉེན་ཆས་འདི་གསར་བཟོའི་ ཆེད་དཔལ་འབྱོར་མཐུན་འགྱུར་གནང་བར་ཐུགས་རྗེ་ཆེ་ཞུ་རྒྱུ་ཡིན།།';
}
