Repository: OpenPecha/gompa-tour
Catalog: lib/l10n/app_*.arb
Languages: bo

# appName
source: Neykor
bo: དགོན་སྐོར་

source: Home
bo: ཁྱིམ།

source: Map
bo: ཁྱིམ།

source: QR
bo: ཀྱུ་ར།

# search
source: Search here...
bo: འཚོལ།

source: Settings
bo: སྒྲིག་འགོད།

source: Appearance
bo: སྣང་བ།

source: Language
bo: སྐད་ཡིག

source: Support
bo: རྒྱབ་སྐྱོར།

source: Legal
bo: ཁྲིམས་ལུགས་

source: System
bo: ལམ་ལུགས་

source: Dark
bo: མུན་ནག་

source: Light
bo: འོད།

source: FAQ
bo: དྲི་བ་དྲིས་ལན།

source: Contact Us
bo: འབྲེལ་གཏུགས།

source: Privacy Policy
bo: སྒེར་གནས་སྲིད་ཇུས།

source: Contact Support
bo: འབྲེལ་མཐུད།

source: Send Email
bo: གློག་འཕྲིན་

source: Close
bo: ཁ་རྒྱག

# recentSearches
source: Recent Search
bo: ཉེ་ཆར་གྱི་འཚོལ་བྱེད།

source: Suggestion
bo: འོས་སྦྱོར།

source: Detail
bo: ཞིབ་ཕྲ།

# deities
source: Statues
bo: རྟེན་བཤད།

# organizations
source: Monasteries
bo: ཆོས་སྡེ།

# festival
source: Festivals
bo: དུས་ཆེན།

source: Deity
bo: རྟེན་བཤད།

# organization
source: Monastery
bo: ཆོས་སྡེ།

source: Scan QR Code
bo: ཚབ་ཨང་ཕབ་སྒྱུར།

source: Address
bo: ཁ་བྱང་

source: Location
bo: ས་གནས།

source: No Record Found
bo: གྲོས་བསྒྲིག་མི་འདུག

source: No Recent Search
bo: ཉེ་ཆར་གྱི་འཚོལ་བཤེར་ལོ་རྒྱུས་

source: Buddha
bo: སངས།

source: King
bo: རྒྱལ།

source: Gaden
bo: དགའ་ལྡན།

source: Arya
bo: ཨརྱ།

source: Acharya
bo: སློབ་དཔོན་

source: Milarepa
bo: མི་ལ་རེ་པ།

source: India
bo: རྒྱ་གར།

source: Nepal
bo: བལ་ཡུལ།

source: Bhutan
bo: འབྲུག་ཡུལ།

source: Dark Mode
bo: འཆར་ངོས་ནག་པོ།

source: Theme
bo: འཆར་ངོས།

source: About Us
bo: ང་ཚོའི་སྐོར།

# aboutApp
source: About This App
bo: མཉྲེན་ཆས་འདི་སྐོར།

# prayerApp
source: Tibetan Prayer App
bo: ཞལ་འདྐོན་མཉྲེན་ཆས་སྐོར།

source: Share App
bo: མཉྲེན་ཆས་བརྒྱུད་སྐུལ།

source: Nyingma
bo: རྙིང་མ།

source: Kagyu
bo: བཀའ་བརྒྱུད།

source: Sakya
bo: ས་སྐྱ།

source: Gelug
bo: དགེ་ལུགས།

source: Bon
bo: བོན།

source: Jonang
bo: ཇོ་ནང་།

source: Remey
bo: རིས་མེད།

source: Shalu
bo: ཞ་ལུ།

source: Bodong
bo: བོ་དོང༌།

source: Others
bo: གཞན།

source: All Gonpa
bo: དགོན་པ་ཡོངས་རྫོགས།

# pilgrimage
source: Pilgrimages
bo: གནས།

source: Neykor
bo: གནས་སྐོར།

# deptName
source: Department of Religion and Culture
bo: ༄༅། །བོད་མིའི་སྒྲིག་འཛུགས་ཆོས་རིག་ལས་ཁུངས།

# deptDescription
source: The Department of Religion and Culture is a ministry office established under the executive organ of Central Tibetan Administration whose function is to overlook religious and cultural affairs in Tibetan exile community. It has the responsibility of supervising works aimed at reviving, preserving, and promotion of Tibetan religious and cultural heritage that is being led to the verge of extinction in Tibet. It began its operation in exile community as Council for Religious Affairs office on April 27, 1959, headed by a Director and constituted by the representative of the four Buddhist schools as its principal members in Mussorrie. On 30th May 1960, the Council for Religious Affairs shifted its office to Dharamsala and on September 12, 1960, it became one of the seven main departments when His Holiness the Dalai Lama formally established the Central Tibetan Administration (CTA). Under the affiliation of this department, there are 255 monasteries and 37 nunneries in India, Nepal and Bhutan and also five cultural institutions across India
bo: ༄༅།། འཛམ་གླིང་སྐྱེ་འགྲོའི་བདེ་སྐྱིད་ལ་ཇི་མི་སྙམ་པར་རྒྱ་ནག་སྲིད་གཞུང་གིས་བོད་ནང་བཙན་འཛུལ་བྱས་ཏེ་བོད་ཆོས་ལྡན་གྱི་རྒྱལ་ཁབ་བཙན་བཟུང་བྱས་པར་བརྟེན། ༸གོང་ས་༸སྐྱབས་མགོན་ཆེན་པོ་མཆོག་གིས་སྐྱེ་འགྲོ་སྤྱི་དང༌བྱེ་བྲག་བོད་མིའི་འཕྲལ་ཕུགས་ཕན་བདེ་ལ་དགོངས་པ་ཆེ་བཞེས་ཀྱིས་རྒྱ་གར་འཕགས་པའི་ཡུལ་དུ་༸ཞབས་སོར་འཁོད་འཕྲལ། ཕྱི་ལོ་ ༡༩༥༩ ཟླ་ ༤ ཚེས་ ༢༧ ཉིན་བཞུགས་སྒར་མ་སུ་རིར་དང་ཐོག་༼ཆོས་དོན་ལྷན་ཚོགས་༽ཞེས་པ་གསར་འཛུགས་ཀྱིས་བྲོས་བྱོལ་དུ་ཕེབས་པའི་རིས་མེད་དགེ་འདུན་རྣམས་ལ་གཟིགས་སྐྱོང་དང་། ཆོས་སྡེ་དང་རིག་གཞུང་བསྟི་གནས་བཅས་པ་གསར་འཛུགས་གནང་རྒྱུས་མཚོན། བོད་ཀྱི་ཆོས་དང་རིག་གཞུང་མི་ཉམས་རྒྱུན་འཛིན་དང་ཉམས་པ་སླར་གསོ་བྱ་རྒྱུའི་ལས་དོན་ཆེ་ཕྲ་མང་པོ་བསྐྱངས་པ་ནས་བཟུང་། ཕྱི་ལོ་ ༡༩༨༢ ཟླ་ ༤ ཚེས་ ༢༥ ཉིན་གནས་ཡུལ་རྒྱལ་ཁབ་ཀྱི་ཁྲིམས་སྲོལ་དང་མཐུན་པར་བོད་ཀྱི་རིག་གཞུང་ཚོགས་པ་དང༌། ཕྱི་ལོ་ ༡༩༩༨ ཟླ་ ༦ ཚེས་ ༡༩ ཉིན་བོད་ཀྱི་ཆོས་དང་རིག་གཞུང་ཚོགས་པ་ཞེས་པའི་མཚན་ཐོག་དེབ་བསྐྱེལ་དང་སྦྲགས་མང་གཙོའི་ཁྲིམས་ལུགས་ལྡན་པའི་དབུས་བོད་མིའི་སྒྲིག་འཛུགས་ཀྱི་འཛིན་སྐྱོང་སྡེ་ཚན་ཁོངས་ལྷན་ཁང་ཞིག་གི་ངོ་བོར་༼ཆོས་རིག་ལས་ཁུངས།༽ཞེས་གནས་ཡོད།

# aboutAppDescription
source: In 1959, Tibet experienced a major upheaval that resulted in the destruction of over 6,000 monasteries and priceless historical documents. Despite this devastating period, the Tibetan community in exile, led by His Holiness the Dalai Lama and other religious leaders, has worked tirelessly over the past 65 years to rebuild and preserve Tibetan cultural heritage. With economic and living standards improving globally, tourism has been steadily increasing across various regions. Pilgrims and travelers visiting Tibetan settlements now include not just Tibetans, but also Himalayan Buddhists, Indians and numerous international visitors. In response to this growing interest, the Department of Religion and Culture of the Central Tibetan Administration has developed a mobile application that provides a useful guide for visitors to Tibetan monasteries and sacred Buddhist sites. This Neykor application serves as an innovative educational tool, allowing diverse groups of visitors to gain meaningful insights into the rich background of Tibetan monasteries and their significant religious artifacts, thereby promoting cultural awareness and appreciation. Through this mobile app, travelers can learn about Tibetan monasteries, sacred artifacts, Buddhist sites and important Tibetan festivals. The application helps visitors understand the value of Tibetan culture and religion, particularly targeting young Tibetans and Himalayan Buddhists. We hope that this application will provide meaningful information about the Tibetan monasteries and its sacred statues and religious artifacts for the users.
bo: ༄༅། །ཕྱི་ལོ་ ༡༩༥༩ ལོར་བོད་ལ་དུས་འགྱུར་ཆེན་པོ་བྱུང་བའི་དབང་གིས་བོད་ཀྱི་ལོ་རྒྱུས་ལྡན་པའི་རྩ་ཆེའི་དགོན་པ་དང་ལྷ་ཁང་དྲུག་སྟོང་ལྷག་རྩ་གཏོར་བཏང་བ་མ་ཟད། ཤིན་ཏུ་རྩ་ཆེའི་ཡིག་ཆ་གྲངས་ལས་འདས་པ་རྩ་མེད་བཟོས་ཡོད་ན་ཡང་རྒྱ་གར་དུ་བཙན་བྱོལ་བོད་མིའི་སྒྲིག་འཛུགས་གསར་འཛུགས་དང་། ལྷག་པར་དུ་སྤྱི་ནོར་༸གོང་ས་༸སྐྱབས་མགོན་ཆེན་པོ་མཆོག་གིས་དབུས་པའི་ཆོས་བརྒྱུད་ཁག་གི་དབུ་ཁྲིད་བླ་ཆེན་ཁག་དང་། རིས་མེད་བསྟན་བདག་བླ་ཆེན་རྣམ་པས་སྐུ་ངལ་ཁྱད་བསད་ལ་བརྟེན་ནས་འདས་པའི་ལོ་ངོ་ ༦༥ ཙམ་ནང་བཙན་བྱོལ་དུ་རྒྱ་བལ་འབྲུག་གསུམ་ནང་དགོན་སྡེ་རྒྱ་ཕྲག་མང་པོ་ཕྱག་བཏབ་སྟེ། ད་ཆ་བོད་མིའི་འདུས་སྡོད་ས་གནས་ཁག་ནང་བོད་ཀྱི་དགོན་སྡེ་དང་། ལྷ་ཁང་མང་པོ་ཡོད་པ་མ་ཟད། དེ་དག་ནང་རྩ་ཆེའི་སྐུ་གསུང་ཐུགས་རྟེན་གྲངས་ལས་འདས་པ་ཡོད། དེང་སང་མི་རྣམས་ཀྱི་དཔལ་འབྱོར་དང་འཚོ་བར་ཡར་རྒྱས་ཕྱིན་པར་བརྟེན། ཡུལ་ལུང་སོ་སོའི་ནང་ཡུལ་སྐོར་སྤྲོ་འཆམ་ཇེ་མང་དུ་འགྲོ་བཞིན་ཡོད་པ་དང་། བོད་མིའི་གཞིས་ཆགས་ཁག་དུའང་བོད་ཀྱི་ཆོས་སྡེ་ཁག་ཏུ་གནས་སྐོར་སོགས་ལ་ཕེབས་མཁན་བོད་པ་ཙམ་མ་ཡིན་པར་ཧི་མཱ་ལ་ཡའི་རི་རྒྱུད་ཀྱི་བོད་རིགས་ནང་པ་དང་། རྒྱ་གར་བ། དེ་བཞིན་ཕྱི་རྒྱལ་མི་རིགས་མང་དག་ཅིག་སླེབས་བཞིན་ཡོད། དེ་དང་བསྟུན་ནས་བོད་མིའི་སྒྲིག་འཛུགས་ཆོས་རིག་ལས་ཁུངས་ནས་གནས་སྐོར་དང་ཡུལ་སྐོར་སྤྲོ་འཆམ་ལ་ཕེབས་མཁན་ཚོས་དགོན་པ་དང་སྐུ་གསུང་ཐུགས་རྟེན་མཇལ་བ་ཙམ་མ་ཡིན་པར་དགོན་སྡེའི་ལོ་རྒྱུས་དང་། དེ་དག་ནང་དུ་ཡོད་པའི་སྐུ་རྟེན་ཁག་གི་སྐོར་མདོར་ཙམ་མཁྱེན་རྟོགས་སླད་ཆོས་སྡེ་དང་སྐུ་རྟེན་ངོ་སྤྲོད་ཀྱི་གནས་བསྐོར་མཉེན་ཆས་ཀྱི་ལས་གཞི་དེ་བརྩམས་པ་རེད། མཉེན་ཆས་འདི་བརྒྱུད་ཡུལ་སྐོར་སྤྲོ་འཆམ་དུ་ཕེབས་མཁན་རྣམས་ནས་བོད་ཀྱི་དགོན་སྡེ་དང་རྩ་ཆེའི་སྐུ་རྟེན་ཁག དེ་བཞིན་ནང་པའི་གནས་ཆེན་དང་། བོད་ཀྱི་དུས་ཆེན་སོགས་ཀྱི་སྐོར་ཤེས་རྟོགས་ཐུབ་ནས་བོད་ཀྱི་ཆོས་དང་རིག་གཞུང་གི་རིན་ཐང་ཤེས་རྟོགས་དང་། ལྷག་པར་དུ་བོད་རིགས་གཞོན་སྐྱེས་དང་ཧི་མཱ་ལ་ཡའི་ནང་པ་གཞོན་སྐྱེས་ཚོས་དགོན་སྡེ་ཁག་ནང་ཕེབས་པའི་སྐབས་དུས་རབས་ཉེར་གཅིག་གི་ནང་པ་ཞིག་ཡིན་པའི་ཆ་ནས་སྐུ་རྟེན་སོགས་ངོ་སྤྲོད་ཤེས་པའི་ཐོག་ནས་དད་པ་སྐྱེས་ཐུབ་ཡག་ལ་ཕན་ཐོགས་ཆེན་པོ་ཡོང་ཐུབ། མཉེན་ཆས་འདིའི་ནང་དགོན་སྡེ་དང་སྐུ་རྟེན་ངོ་སྤྲོད་གཅིག་པུ་མ་ཡིན་པར་ད་དུང་ཆོས་སྡེ་ཁག་སོ་སོའི་ས་ཁྲ་དང་། དུས་ཆེན་ངོ་སྤྲོད་སོགས་ཀྱང་གཟིགས་རྒྱུ་ཡོད། ང་ཚོའི་རེ་བར་དགོན་སྡེ་ཁག་ལ་ཕེབས་མཁན་རྣམས་ཀྱིས་གནས་བསྐོར་མཉེན་ཆས་འདི་བརྒྱུད་དགོན་པའི་ལོ་རྒྱུས་དང་། སྐུ་རྟེན་ངོ་སྤྲོད། གནས་ཆེན་སོགས་ཀྱི་སྐོར་སྙིང་བསྡུས་མཁྱེན་ཐུབ་པའི་རེ་བ་ཡོད། ཆོས་རིག་ལས་ཁུངས་ནས། ཕྱི་ལོ་ ༢༠༢༥ ཟླ་ ཚེས་ ལ།།
